name: "fc-example"
input: "data"
input_dim: 1
input_dim: 1
input_dim: 1
input_dim: 1000

layer {
  name: "fc-test"
  type: "InnerProduct"
  bottom: "data"
  top: "fc-out"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1000
  }
}
